{"status":"ok","count":5,"count_total":15,"pages":3,"posts":[{"id":20,"type":"blog_post","slug":"a-note-on-performance","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=a-note-on-performance","status":"publish","title":"A note on performance","title_plain":"A note on performance","content":"<div class='imgGroup col3'><img class='imgWithHero' data-src='img/BSR2010-1.png' src='img/BSR2010-1.png' /><br /><img class='imgWithHero' data-src='img/BSR2009-1.png' src='img/BSR2009-1.png' /><br /><img class='imgWithHero' data-src='img/G2BM-1.png' src='img/G2BM-1.png' /></div><p>I had developed the application to a point where I felt comfortable enough to release it to a few select Beta testers. I had a few friends who graciously volunteered their time in running the game through its paces and among them the 1st gen, 2nd gen, 3g and 3gs iPhones were all represented, as well as a few iPod touches.<\/p>\n<div class='imgGroup col2'><img class='imgWithHero' data-src='img/BSR2010-1.png' src='img/BSR2010-1.png' /><br /><img class='imgWithHero' data-src='img/BSR2009-1.png' src='img/BSR2009-1.png' /></div><p>My heart truly sank upon installing the app on the original 3g for the first time. I had recently upgraded to the 3GS (read dropped and broke my 1st gen) iPhone and had been testing solely on the 3GS with the knowledge that I would suffer a performance hit on the older phones, but never did I think that the difference as great as it was. The application loaded fine on the older devices and you could navigate through the start page, the level select page and the cheese select page, but it almost always crashed when loading the level itself. I was well within the parameters suggested for OpenGL ES on the iPhone. I had kept my draw calls below 30 and my vert count never really crested above 7,000. I assumed that I was dealing with a memory issue, but wasn&#8217;t able to pin point where the problem was.<\/p>\n<p>I first tried to reduce the complexity of the level load. I built an editor script that would parse through all of my gameplay objects (colliders, speed adjusters, respawn points, coin and hourglass pickups) for each level and return their respective position, rotation and scaling values as an array of Vector3 objects. I then removed all of these gameplay objects from the level scenes and dynamically rebuilt them at runtime within the event handler that fires off at the beginning of the level. This way when I loaded a level, I was effectively loading just the level&#8217;s 3D mesh, one or two scripts and a few prefabs. This actually dramatically reduced the level load times on the 3GS, but I still had the crashing issue on the older devices.<\/p>\n<p>When profiling the app using Apple&#8217;s Instruments application I noticed that my memory consumption was peaking at times around 140mb. After some research I learned that the iPhone OS will actually kill any processes that eats up too much ram, but could not for the life of me figure out what element of my game was chewing up all of this memory.<\/p>\n<p>I knew that OpenGL ES 1.x required that all textures mapped to meshes must have square dimensions that were a power of two. What I was not aware of was the how 2D texture objects were treated in Unity. I learned that any 2D textures using PVRTC compression that do not have dimensions that are a power of two would be upscaled to 1024&#215;1024. This being the case the memory spike I was witnessing became clearer. I had numerous small images that made up the game&#8217;s GUI, some as small as 18&#215;18, yet they were all being bloated at runtime to gargantuan proportions. It seems entirely counter-intuitive, but by scaling my images up to the nearest power of two value I saw my memory load drop drastically and load times became even quicker. The app is now running from 21mb to 45mb and I&#8217;ve yet to get a crash report from any of my beta testers.<\/p>\n<p>Looking back, it really does seem like a noob mistake to make, but the lesson has been learned and I&#8217;ve moved on <img src='http:\/\/blog.jeremyclewell.com\/wp-includes\/images\/smilies\/icon_wink.gif' alt=';)' class='wp-smiley' \/>  Time to submit the app!<\/p>\n","excerpt":"I had developed the application to a point where I felt comfortable enough to release it to a few select Beta testers. I had a few friends who graciously volunteered their time in running the game through it's paces...\r\n","date":"2010-03-31 04:36:23","modified":"2012-03-28 17:16:24","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":8,"slug":"game-design","title":"Game Design","description":"","post_count":2},{"id":9,"slug":"ios","title":"iOS","description":"","post_count":11},{"id":10,"slug":"iphone","title":"iPhone","description":"","post_count":11},{"id":11,"slug":"unity","title":"Unity","description":"","post_count":11}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[{"id":3,"name":"Mark Rogers","url":"","date":"2010-06-02 15:22:02","content":"<p>Hi. <\/p>\n<p>Nice app, but a couple of cosmetic comments&#8230;<\/p>\n<p>Firstly, the label on the cheese should read &#8216;Gloucester&#8217;, not &#8216;Glouchester&#8217; nor &#8216;Gloucestershire&#8217;. <\/p>\n<p>Secondly, the cheese isn&#8217;t Cheddar!  That&#8217;s a different cheese entirely. Gloucester is either &#8216;Double Gloucester&#8217; &#8211; made from two separate milkings milk, and sometimes mass- produced, or &#8216;Single Gloucester&#8217;, made from one milking, and only made locally in Gloucestershire &#8211; mainly in the Severn Vale. <\/p>\n<p>Oddly, Coopers Hill isn&#8217;t in Gloucester, but is in Stroud District. It&#8217;s some 7 miles up the road from me between Stroud, Cheltenham and Gloucester.<\/p>\n<p>I&#8217;ve never been to the Coopers Hill event but have rolled Baby Bel cheeses in the past&#8230;<\/p>\n","parent":0},{"id":4,"name":"Jeremy Austin Clewell","url":"","date":"2010-06-03 05:23:11","content":"<p>@Mark<\/p>\n<p>First off, thanks for posting! I&#8217;m actually aware of the mis-labeling of the Double Gloucester and will be making the correction with the next application update. You&#8217;d be surprised at the ambiguity found regarding the details of this event on the web!<br \/>I was in a bit of a rush to get the application launched, but fully intend to give geographical credit where credit is due. Rest assured, the corrections are forthcoming.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"open"},{"id":19,"type":"blog_post","slug":"supporting-web-presence","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=supporting-web-presence","status":"publish","title":"Supporting web presence","title_plain":"Supporting web presence","content":"<p>I was getting to the point where I needed to start thinking about building a webpage for Cooper&#8217;s Hill. I needed something that would act as both a presale marketing site and a development blog, additionally I wanted a private bug tracker\/forum accessible only by myself and the beta testers. I build websites\/applications everyday at work, but wasn&#8217;t about to embark on a custom project as large scale as what I needed, I just didn&#8217;t have the time. I had though about stringing together a bunch of prebuilt web apps ( <a title=\"Wordpress\" href=\"http:\/\/wordpress.org\/\" target=\"_blank\"> WordPress<\/a>, <a title=\"phpBB\" href=\"http:\/\/www.phpbb.com\/\" target=\"_blank\">phpBB<\/a>, <a title=\"Bugzilla\" href=\"http:\/\/www.bugzilla.org\/\" target=\"_blank\">Bugzilla<\/a> ) and then give the landing page a fancy flash piece to really drive it home, but again, time was the issue and the game should be getting the majority of my attention, not the supporting website. Things might be different if I had a full team working on the app and I could dedicate one individual to marketing\/site-construction and management. Ultimately, considering the limited resources at my disposal, I was left looking for an entirely out of the box solution.<\/p>\n<p>I had stumbled upon <a title=\"Squarespace\" href=\"http:\/\/www.squarespace.com\/\" target=\"_blank\">Squarespace<\/a> a few months earlier and was impressed, but could not foresee how or why I would ever employ their services; after all, I&#8217;m a web developer by trade. It seems counter intuitive to hire what may be becoming the independent web developer&#8217;s biggest competitor to build and host my own website. For those who don&#8217;t know, Squarespace offers hosting and development services all wrapped up in a nice web-based front end. Basic site design is handled via a very slick WYSIWYG in the browser and the integration of a blog\/forums\/form handling\/analytics and an assortment of other handy tools is entirely painless. With their advanced package you&#8217;re able to supply your own custom CSS and inject custom scripts anywhere within the page. I decided to give them a shot.<\/p>\n<p>I sat down and started working on a site comp as I normally would do, but with the assumption that when it was time to implement the design I&#8217;d have to make some sacrifices to get it to fit within Squarespace&#8217;s templates. This was not the case at all as the Squarespace environment proved to be much more flexible than I thought it would have been. With a little bit of coaxing I was able to get the live site pretty much pixel perfect in every major browser except IE. I should at this point probably apologize to anyone reading this using Internet Explorer. Honestly, and I know this may be petty of me, but I just don&#8217;t have the time or the patience to develop this site for those of you browsing the web with a browser that is not standards compliant. I&#8217;ve spent a good portion of my professional career building enterprise level sites that render out uniformly across Gecko, Webkit a IE6+ browsers. I&#8217;m well aware that this blog is ultimately a commercial device and that I may be deterring potential consumers, but at this point my main concern is launching the iPhone app. I may in the future revisit the style sheets to ensure at least IE8+ compatibility, but don&#8217;t hold your breath <img src='http:\/\/blog.jeremyclewell.com\/wp-includes\/images\/smilies\/icon_wink.gif' alt=';)' class='wp-smiley' \/>  Considering that, I should make it known that all of the default Squarespace styles do render well on IE and any display issues you may encounter are purely due to my own custom styles.<\/p>\n<p>At any rate, the site is done and it&#8217;s serving it&#8217;s purpose. I&#8217;ve created the obligatory, companion <a title=\"Facebook\" href=\"http:\/\/www.facebook.com\/pages\/Coopers-Hill-on-the-iPhone\/335206365881\" target=\"Facebook\">Facebook<\/a> and <a title=\"Twitter\" href=\"http:\/\/twitter.com\/CoopersHillGame\" target=\"_blank\">Twitter<\/a> accounts as well, so as far as the initial web presence, I think I&#8217;m covered. Now back to the app.<\/p>\n","excerpt":"I was getting to the point where I needed to start thinking about building a webpage for Cooper's Hill. I needed something that would act as both a presale marketing site and a development blog, additionally I wanted  a private bug tracker\/forum accessible only by myself and the beta testers\r\n","date":"2010-03-28 19:09:34","modified":"2012-03-28 17:14:07","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":12,"slug":"web-design","title":"Web Design","description":"","post_count":1}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[{"id":2,"name":"Jane Darwin","url":"http:\/\/glowhost.com\/","date":"2010-09-09 06:35:30","content":"<p>I&#39;ve seen quite a lot of good reviews already about this new platform they call Squarespace. I still haven&#39;t made the switch, though. But hearing one from a web developer like you, I think I&#39;m close to getting swayed. Good choice of template, by the way.<\/p>\n<p>Jane Darwin<br \/><a href=\"http:\/\/glowhost.com\" rel=\"nofollow\">best web hosting<\/a><\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"open"},{"id":18,"type":"blog_post","slug":"building-a-soundtrack","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=building-a-soundtrack","status":"publish","title":"Building a soundtrack","title_plain":"Building a soundtrack","content":"<p>Audio plays such a large role in providing a believable, or at least enjoyable, environment for a game player to exist within. It can act as a direct conduit to the player&#8217;s emotional core and truly add a layer of depth and substance without which the game would obviously be lacking. Unfortunately few games ever seem to utilize the power of audio to its fullest extent and the short list of those notables who have succeeded in this realm often go unnoticed. One of the rare successes that comes to mind would be Secret Exit&#8217;s <a title=\"Zen Bound\" href=\"http:\/\/zenbound.com\/\">Zen Bound<\/a>. I don&#8217;t believe I&#8217;ve ever been lulled into such a numbing, catatonic state as this game had cast over me. Ghost Monkey put together a phenomenal soundtrack that wove into the overall aesthetic seamlessly and unified the entire game play experience. I knew that what ever I did would pale next to this, but I had to try to come up with something anyway.<\/p>\n<p>The game has rather a quirky feel to it, so I thought it best that the soundtrack should follow suit. I originally wanted to license some tracks from a few of my favorite artists that I thought would fit the bill. I needed something that had a feeling of chaos and speed, but without being too serious. There are a few bands in the Eastern European folk tradition that would have been ideal ( <a title=\"A Hawk and a Hacksaw\" href=\"http:\/\/www.ahawkandahacksaw.co.uk\/\"> A Hawk and a Hacksaw<\/a>, <a title=\"Leningrad\" href=\"http:\/\/www.leningradspb.ru\/\"> Leningrad<\/a>, <a title=\"Gogol Bordello\" href=\"http:\/\/gogolbordello.com\"> Gogol Bordello<\/a>, The West Philadelphia Orkestra), but the fees to license the songs were cost prohibitive. I had to find a different way.<\/p>\n<p>I do have a number of friends who are musicians and had thought quite seriously about asking them to lay down a soundtrack for me, but that was a huge favor to ask and I really didn&#8217;t have the time to wait for them to compose and then record something. I could always go the canned music route, but after about an hour browsing clips I knew I&#8217;d never find anything that was close to what I wanted.<\/p>\n<p>So I walked down to the local Apple Store and picked up a copy of the <a title=\"World Music Jam Pack\" href=\"http:\/\/store.apple.com\/us\/product\/MA211Z\/A\"> World Music Jam Pack<\/a> for GarageBand\/Logic Pro\/Soundtrack Pro. When I got home I installed the loops and instruments that were on the disk and set to work composing something that would hopefully fit the bill. Within 3 hours I had roughed out the theme song of the game. It wasn&#8217;t perfect and it was far from professional, but it was good enough for now. Here&#8217;s what I came up with:<\/p>\n<p><img onclick=\"openModWindow({content: '&lt;embed src=\" src=\"\/images\/mp3_icon.png\" alt=\"\" width=\"425\" height=\"16\" \/><\/p>\n<p>The next night I cleaned up the song a bit. I added some more dynamics and generally rounded things out. I then derived a loop that would play during the start scene and the cheese and level select scenes. I would have liked to have included a different song for each level, and even though it only took two evenings to come up with the first song, I just felt I should be concentrating on other issues&#8230;maybe in version 2.0. I&#8217;d also like to add more natural sounds to the button clicks and sound effects to the game itself. It would be nice if there was a rushing wind loop that had it&#8217;s intensity controlled by the velocity of the cheese. Additionally, my collisions are all silent. I&#8217;d love to trigger a muted crashing sound when the cheese wheel smashes into something. These are all wish list items that I&#8217;ll hopefully be including in the next version. Honestly, it was so much fun putting the song together in GarageBand, I&#8217;m really looking forward to extending the soundtrack!<\/p>\n","excerpt":"Audio plays such a large role in providing a believable, or at least enjoyable environment for a game player to exist within.\r\n","date":"2010-03-28 18:31:35","modified":"2012-03-28 17:13:11","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":8,"slug":"game-design","title":"Game Design","description":"","post_count":2}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"},{"id":17,"type":"blog_post","slug":"more-2d-assets-digital-painting","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=more-2d-assets-digital-painting","status":"publish","title":"More 2D assets (Digital Painting)","title_plain":"More 2D assets (Digital Painting)","content":"<p><img style=\"width: 150px;\" src=\"\/storage\/post-images\/sketches1.png\" alt=\"\" \/><br \/>\n<span style=\"width: 150px;\">The original sketch<\/span><\/p>\n<p>About five years ago I bought a book entitled &#8220;<a href=\"http:\/\/www.amazon.com\/Digital-Character-Design-Painting-Graphics\/dp\/1584502320\" target=\"_blank\">Digital Painting and Character Design<\/a>&#8221; by <a href=\"http:\/\/www.seegmillerart.com\/\" target=\"_blank\">Don Seegmiller<\/a>. It focused a lot on color theory an portraiture, as well as provided a very good introduction to <a href=\"http:\/\/www.corel.com\/servlet\/Satellite\/us\/en\/Product\/1166553885783#tabview=tab0\" target=\"_blank\">Corel&#8217;s Painter<\/a> application. Don&#8217;s tutorials walked you through painting some very interesting characters and what&#8217;s more, he included QuickTime movies of his painting process, sped up of course, for most if the pieces in the book. This was such a great idea. Watching him work on a drawing and having it come to life before your eyes in high speed was almost mesmerizing. I had recently purchased a copy of <a href=\"http:\/\/www.ambrosiasw.com\/utilities\/snapzprox\/\" target=\"_blank\">Snapz Pro X<\/a>, a video screen capturing tool for work and decided to have a go at recording my own creation.<\/p>\n<p><span style=\"float: right;\"><img style=\"width: 150px;\" src=\"\/storage\/post-images\/lilguy.jpg\" alt=\"\" \/><\/span><span class=\"thumbnail-caption\" style=\"width: 150px;\">The finished painting<\/span><br \/>\n<br \/>I wanted to somehow include the iconic <a href=\"http:\/\/www.dinnerexplorer.com\/images\/themes\/9b0f3762e66b4d7e921e1737621807c2.jpg\" target=\"_blank\">Cooper&#8217;s Hill Master of Ceremonies<\/a> in the game. I thought that by providing a face to the introduction and tutorials it would add some warmth to the game itself. I had sketched out an idea of how I thought he should look, then scanned in the image and set to work. What you see below is about four hours of work compressed down to five minutes, I&#8217;m sure a comparable piece by Don would have taken half the time and been twice as good <img src='http:\/\/blog.jeremyclewell.com\/wp-includes\/images\/smilies\/icon_wink.gif' alt=';)' class='wp-smiley' \/>  I apologize for the jittery motion of the video, I was working on my laptop for this and spent a lot of time viewing in higher magnifications. Overall I think it turned out okay.<\/p>\n<p><img onclick=\"openModWindow({content: '&lt;object width=\" src=\"http:\/\/vimeo.com\/moogaloop.swf?clip_id=9707946&amp;server=vimeo.com&amp;show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=ffffff&amp;fullscreen=1\" alt=\"\" name=\"movie\" width=\"720\" height=\"432\" \/><\/p>\n","excerpt":"About five years ago I bought a book entitled \"Digital Painting and Character Design\" by Don Seegmiller. It focused a lot on color theory an portraiture, as well as provided a very good introduction to Corel's Painter application.\r\n","date":"2009-11-11 06:58:00","modified":"2012-03-28 17:11:27","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":4,"slug":"artwork","title":"Artwork","description":"","post_count":1},{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":6,"slug":"digital-painting","title":"Digital Painting","description":"","post_count":1}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"},{"id":16,"type":"blog_post","slug":"the-title-screen","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=the-title-screen","status":"publish","title":"The title screen","title_plain":"The title screen","content":"<p><a title=\"The Game Title\" href=\"\/storage\/post-images\/startPageTitle.png\" rel=\"images\"><img style=\"width: 450px;\" src=\"\/storage\/post-images\/startPageTitle.png\" alt=\"\" \/><\/a>When I originally built the start page for Cooper&#8217;s Hill, I had done it in 3D. I used the Cooper&#8217;s Hill level mesh, positioned the camera at the bottom and pointed it uphill. In the foreground I placed a rotating wheel of cheese to the right side of the screen. I then overlaid the whole scene with the start menu itself.  When you tilted the iPhone to the left or right the camera would slide in the same direction, giving you a nice perspective shift. In theory this would have worked great, but there were two problems. The start page is the first thing the customer is going to see. It&#8217;s the point of entry for the entire game and visually it should be highly polished. I was using in-game geometry for the background, and it just wasn&#8217;t cutting it&#8230;I couldn&#8217;t get the level if detail I wanted by just repurposing one of my game levels. Secondly, the scene itself was a little too complex. I want the start page to load as quickly as possible, and building out a full scene was slowing down my load time considerably.<\/p>\n<p>I decided to paint a 2D backdrop to act as the start page. I&#8217;d then cut it up and place it on 3 planes within a 3D space to get a 2.5D appearance. Unfortunately the filtering on the textures when applied to the planes in 3d blurs the image beyond acceptable levels. This leaves me with no other choice than to display the imagery using GUITextures and abandon the 2.5D approach entirely. I&#8217;m sure that it could be faked by manipulating the textures&#8217; position, but I&#8217;m not going to expend any time fiddling with it now, the start page has already taken too long. Here&#8217;s the finished product. It&#8217;s just a flat background image with some GUI Buttons placed on top. I think it looks just fine, and it loads very quickly which was my number one concern from the beginning. It helps to pick your battles.<br \/>\n<a title=\"Homepage buttons\" href=\"\/storage\/post-images\/homepage-Buttons.png\" rel=\"images\"><img style=\"width: 200px;\" src=\"\/storage\/post-images\/homepage-Buttons.png\" alt=\"\" \/><\/a><span style=\"width: 200px;\">Homepage buttons<\/span><a title=\"The background\" href=\"\/storage\/post-images\/startPage.jpg\" rel=\"images\"><img style=\"width: 200px;\" src=\"\/storage\/post-images\/startPage.jpg\" alt=\"\" \/><\/a><span class=\"thumbnail-caption\" style=\"width: 200px;\">The background<\/span><\/p>\n<p><a title=\"The final start page\" href=\"\/storage\/post-images\/startPageFinal.png\" rel=\"images\"><img style=\"width: 450px;\" src=\"\/storage\/post-images\/startPageFinal.png\" alt=\"\" \/><\/a><span class=\"thumbnail-caption\" style=\"width: 450px;\">The final start page<\/span><\/p>\n","excerpt":"When I originally built the start page for Cooper's Hill, I had done it in 3D. I used the Cooper's Hill level mesh, positioned the camera at the bottom and pointed it uphill. In the foreground I placed a rotating wheel of cheese to the right side of the screen\r\n","date":"2009-10-08 05:54:00","modified":"2012-03-27 03:31:09","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":9,"slug":"ios","title":"iOS","description":"","post_count":11},{"id":10,"slug":"iphone","title":"iPhone","description":"","post_count":11},{"id":11,"slug":"unity","title":"Unity","description":"","post_count":11}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"}]}