{"status":"ok","count":5,"count_total":15,"pages":3,"posts":[{"id":15,"type":"blog_post","slug":"a-steering-problem","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=a-steering-problem","status":"publish","title":"A steering problem","title_plain":"A steering problem","content":"<p>So after seven days and eight nights of palm trees, margaritas and newfound matrimonial bliss, we&#8217;d come back to Philadelphia where it was rainy and cold. Missing the tropics, I hunkered down and started up development on the game again. I had let a few friends at work go a round or two on Cooper&#8217;s Hill as I was developing it to get some early impressions as to how it played. They all seemed to pick up the knack of it after the first or second attempt but they commented on how the frame rate seemed to drop occasionally. I had noticed this as well, but seeing that I still as of yet haven&#8217;t optimized any of my scripts (a lot of them were still in what you might call a sketch state) I was hoping the issue would right itself after I spent some time cleaning up my code. It should also be mentioned that I&#8217;m testing on a first gen 4gb iPhone.  What I didn&#8217;t notice, but luckily my coworkers did, was the performance drop seemed to coincide with whenever the player made a hard turn to either the left or right. This pointed a finger at my control script and made me think that I should probably rethink how I was maneuvering the cheese wheel.<\/p>\n<p>If you read my <a href=\"http:\/\/www.coopershillgame.com\/blog\/2009\/7\/25\/thanks-you-blender.html\">earlier post<\/a> you&#8217;ll remember that my control script utilized two box colliders sandwiching the mesh collider of my cheese which in turn rolled down the mesh collider attached to the game level. To turn I would rotate the enclosing box colliders as a unit around the cheese wheel&#8217;s local y axis and then update the position of the collider&#8217;s rig to match that of the cheese wheel. That&#8217;s four colliders all interacting with each other in addition to about 25 lines of code executing on every physics time-step&#8230;there had to be an easier way. I tried replacing everything with a single sphere collider and controlling all the steering programmatically. This proved to be very frustrating. I&#8217;m sure that there is a way to limit the movement of a collider to its local y and z axes&#8217;, and a few times I came close to something that resembled the motion that I was looking for, but it was never close enough. 3D vector math really isn&#8217;t that difficult, but I was getting tired of not getting the results I wanted and was worried that my eventual solution would not be as efficient as it needed to be. I took a step back from the problem and tried to look at it from a higher stand point.<\/p>\n<p>I realized that what I was ultimately trying to simulate was lateral friction&#8230;which was already included in Unity&#8217;s wheel collider. So with renewed confidence, I attempted to implement a new control rig that utilized what was already available to me. After some experimentation I had in place a system that worked better than anything I had previously used. It moved more realistically, performed better that I had hoped and fixed the problem of steering in mid air! There was an upside and a downside to this however. While it felt more natural and was a more accurate physical simulation, you now had no way of adjusting your position after you launched off of a jump or ledge. You were helpless in mid-air. This is all well and good, but I had designed and tested the levels with the earlier control model. The game now became much more difficult. The player was prone to falling off cliffs, miscalculating their trajectory off jumps and colliding with object while in flight. I played a few of the levels over and over again before deciding that I actually liked the added difficulty. The challenge transformed my cheesy little game, no pun intended, into a game that truly tested your skill! I did however have to rework a few of my speed adjusters to give the players a push in the right direction when needed, but all in all, I was happy with how it turned out.<\/p>\n<p>This pretty much brings us up to present day. I still have a few more 2D assets I need to generate, I need to finalize the start menu, I have to figure out how I&#8217;m going to handle the music and sound for the game, I have some more tweaking to the speed adjusters to make, I need to build the website to promote the app and host the development blog and I need to beta test the app itself&#8230;.then I&#8217;ll finally be ready to submit Cooper&#8217;s Hill to the app store.<\/p>\n","excerpt":"So after seven days and eight nights of palm trees, margaritas and newfound matrimonial bliss, we're came back to Philadelphia where it was rainy and cold. Missing the tropics, I hunkered down and started up development on the game again.\r\n","date":"2009-09-23 05:41:00","modified":"2012-03-28 17:10:15","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":9,"slug":"ios","title":"iOS","description":"","post_count":11},{"id":10,"slug":"iphone","title":"iPhone","description":"","post_count":11},{"id":11,"slug":"unity","title":"Unity","description":"","post_count":11}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"},{"id":13,"type":"blog_post","slug":"were-married","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=were-married","status":"publish","title":"We&#8217;re married!","title_plain":"We&#8217;re married!","content":"<p>A few months before Renée and I were to go to Mexico she made a joke that we were going to come back either married or pregnant&#8230;well, it turned out to be quite the prophetic quip! We had been trying to plan the wedding for a while and had been visiting venues whenever we could, but none that we had seen felt right. We wanted to do something different; neither of us was looking for the traditional wedding. When I told my mother the joke Renée had made about Mexico, she took it seriously and said it was a great idea. That got us thinking about having a small wedding while we were on vacation and after mulling it over for a few weeks we started making plans. We ended up having our ceremony in Playa del Carmen <a class=\"slideShow\" title=\"Our wedding in Playa del Carmen\">on the beach at sunset<\/a>. It was the best day of my life <img src='http:\/\/blog.jeremyclewell.com\/wp-includes\/images\/smilies\/icon_smile.gif' alt=':)' class='wp-smiley' \/> <\/p>\n<p><a class=\"slideShow\" title=\"Our wedding in Playa del Carmen\"><img src=\"\/storage\/post-images\/wedding_shot.jpg\" alt=\"\" \/><\/a><\/p>\n","excerpt":"A few months before Renée and I were to go to Mexico she made a joke that we were going to come back either married or pregnant...well, it turned out to be quite the prophetic quip!\r\n","date":"2009-09-15 05:00:00","modified":"2012-03-28 17:05:29","categories":[],"tags":[{"id":7,"slug":"family","title":"Family","description":"","post_count":1}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"},{"id":12,"type":"blog_post","slug":"getting-ready-for-mexico","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=getting-ready-for-mexico","status":"publish","title":"Getting ready for Mexico","title_plain":"Getting ready for Mexico","content":"<p>My goal since the beginning was to work on the game for at least 2 hours a day. My real job is in center city Philadelphia and there is a great <a href=\"http:\/\/www.lacolombe.com\/\" target=\"_blank\">coffee shop<\/a> only two blocks away from my office building. I wanted to put about an hour of time towards the game at the coffee shop every morning before work and then I&#8217;d return at lunch to clock in an additional hour. My fiancé and I had just moved into a new place in the Art Museum district of Philadelphia and our nights were for the most part consumed with making a home for ourselves. This left me only about 10 hours a week to devote to the game, additionally Renée and I had planned a 7-day vacation to Mexico with her brother and sister-in-law.  I was fairly confident that I wouldn&#8217;t be allowed to bring my laptop on vacation with me, so I had to get crackin&#8217;. I had 3 weeks of vacation left so I requested off for our trip plus an additional week off two weeks before the trip to try to finish as much as I could before we left. During that week off I focused on nailing down my menu system and all of the 2D assets I would need for it, my high score script and the HUD that would be on screen while the game was being played. I&#8217;ll be posting later about the GUI system that&#8217;s included with Unity.<\/p>\n<p><span class=\"full-image-block ssNonEditable\"><span><img style=\"width: 450px;\" src=\"\/storage\/post-images\/hud.png\" alt=\"\" \/><\/span><\/span>By the end of my week off I had, for the most part, finalized the menu system. I had also built out the models for the little European deli where the user would choose his cheese and the 3D icons for each of the levels. I was happy with how much I had finished, but still, I wish I was farther along at this point. I had grossly underestimated the amount of work involved in building a game like this, but I was at least at a point where I felt comfortable putting it aside for a week while we were in Mexico. So, off to vacation!<\/p>\n","excerpt":"My goal since the beginning was to work on the game for at least 2 hours a day. My real job is in center city Philadelphia and there is a great coffee shop only two blocks away from my office building. I wanted to put about an hour of time towards the game at the coffee shop every morning before work, then I'd return at lunch to clock in an additional hour.\r\n","date":"2009-09-01 04:50:00","modified":"2012-03-28 17:04:09","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":9,"slug":"ios","title":"iOS","description":"","post_count":11},{"id":10,"slug":"iphone","title":"iPhone","description":"","post_count":11},{"id":11,"slug":"unity","title":"Unity","description":"","post_count":11}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"},{"id":14,"type":"blog_post","slug":"level-design","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=level-design","status":"publish","title":"Level Design","title_plain":"Level Design","content":"<p><a title=\"Castle Neuschwanstein\" href=\"\/storage\/post-images\/castle.jpg\" rel=\"images\"><img style=\"width: 150px;\" src=\"\/storage\/post-images\/castle.png\" alt=\"\" \/><\/a>So on to the construction of the other levels. The next one I started working on was the Bavarian level. I was lucky enough to have a coworker who had recently been to Germany and took some great shots while he was there. He was kind enough to donate the usage of the images to my game, which really did help a lot. I had been planning to use mostly my own photography for texturing my models to lessen the costs I&#8217;d incur in purchasing stock photography, but having never been to Germany, I was hard pressed to find suitable imagery.  My friend&#8217;s photos were not only a great resource for my textures, but also a great source of inspiration. The castle Neuschwanstein was the subject of many of the photographs that he had given me, and it was such a dramatic setting I decided to use it as the focus of the model.<\/p>\n<p><a class=\"unityLinkBox3\" title=\"The Bavarian Level\"><img src=\"\/storage\/post-images\/level3.jpg\" alt=\"\" \/><\/a> I was really beginning to worry about how long production was taking at this point, I had been working on the game for almost four months and still had a substantial amount of work that lay ahead of me. Rather than sketching out the details of the level beforehand, I figured that I would just wing it. I had a basic idea of what I wanted; I&#8217;d just proceed polygon by polygon, finalizing the model as I went along. The player would start off in a small river gully and follow it down to the castle itself. After passing through Neuschwanstein the course would follow a narrow ledge  above a cliff side, across an old rope bridge spanning a chasm, through some fields in a serene Bavarian valley, then into a typical German village, through a winding alley, bouncing down over some roof tops and finally finishing in the medieval town&#8217;s main square.<\/p>\n<p>The model was a lot easier to put together this time. I had a better idea if how my physics model ran and knew how far I could push the geometry before the level began to feel unnatural. Within a week I had the Bavarian level up and running and was generally pleased with the way it turned out. I had only 2 more to go!<\/p>\n<p><a class=\"unityLinkBox4\" title=\"The Matterhorn\"><img src=\"\/storage\/post-images\/level4.jpg\" alt=\"\" \/><\/a>I began working on the Matterhorn model next. I&#8217;d start the player at the very top of the mountain during a blizzard. He&#8217;d be thrown from side to side over a crevasse in the rock then would have to weave through a crack in a glacier. At the bottom of a deep glacial canyon the melt water would have dug out ice tubes and caverns, which the player would have to navigate through, only to be finally ejected out of the glacier into an alpine valley and come to rest by a high altitude lake. This was to be the most difficult level to play, but it was also becoming the most difficult level to rig. At nearly every point of the map I had speed adjusters in place to control the decent of the cheese wheel. After a little bit of work and some testing the level was looking pretty good and I decided to move on to the training level.<\/p>\n<p><a class=\"unityLinkBox1\" title=\"The Training Level\"><img src=\"\/storage\/post-images\/level1.jpg\" alt=\"\" \/><\/a><a class=\"unityLinkBox2\" title=\"Cooper's Hill\"><img src=\"\/storage\/post-images\/level2.jpg\" alt=\"\" \/><\/a>I had saved the first level for last because I hadn&#8217;t been sure how I&#8217;d teach the user to actually play the game. There are really only three concepts to the gameplay. Tilting the device to the left or right steers, tilting the device forward and backward adjusts the mass of the cheese wheel slightly, and when you see a coin or an hourglass try to pick it up. With that in mind I decided to build a simple level that would contain three distinct areas, one for each concept. When the cheese wheel enters one of these areas it would trigger a brief tutorial covering the appropriate concept and then let the player have a go at it. I ended up building a relatively short level set in England, placed my tutorial triggers and with that I was done with all of my levels!<\/p>\n","excerpt":"So on to the construction of the other levels. The next one I started working on was the Bavarian level.\r\n","date":"2009-08-27 05:27:00","modified":"2012-03-28 17:02:35","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":9,"slug":"ios","title":"iOS","description":"","post_count":11},{"id":10,"slug":"iphone","title":"iPhone","description":"","post_count":11},{"id":11,"slug":"unity","title":"Unity","description":"","post_count":11}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"},{"id":11,"type":"blog_post","slug":"the-finer-points-of-a-rewards-system","url":"http:\/\/blog.jeremyclewell.com\/?blog_post=the-finer-points-of-a-rewards-system","status":"publish","title":"The finer points of a rewards system","title_plain":"The finer points of a rewards system","content":"<p>I&#8217;m giving this topic its own posting because it&#8217;s one of the most important elements to any game. I needed to create some type of rewards system. Presently I had no idea of how I was going to congratulate the player for a job well done. I had thought about creating the human participants of the actual Cooper&#8217;s Hill event, in effect acting as an avalanche of bodies, that if caught up to your cheese wheel would end your turn, but that just didn&#8217;t seem plausible. I ended up going with a point system based off of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Super_Mario_Bros.\" target=\"_blank\">coin collection<\/a> (yes I know, that&#8217;s a tired idea, let me know if you come up with something better) and time.<\/p>\n<p>The player now has a time limit to complete the level and as he races to the bottom he is presented with pick-ups placed around the course. They are of two varieties; the coin pick-up, which immediately adds a set point value to the player&#8217;s score, and the hourglass pick-up which add a variable amount of time to the player&#8217;s remaining time to complete the level.<img style=\"width: 150px;\" src=\"\/storage\/post-images\/coin.png\" alt=\"\" \/><br \/>\n<img style=\"width: 150px;\" src=\"\/storage\/post-images\/hourglass.png\" alt=\"\" \/>The amount of time added is in direct proportion to the level of difficulty the player has selected. If the player has the difficulty set to 1, then he gets an extra 25 seconds to complete the level, if the difficulty is set to 10, he may only get an extra 10 seconds tacked onto his remaining time. At the end of the level the time remaining is multiplied by a fraction of his difficulty level and then added to his score as the time bonus.<\/p>\n<p>The time bonus benefits are two fold.  It one; encourages a speedy decent down the hill, enticing players to race rather than take their time and collect every single coin they can, and two; it validates the difficulty setting, rewarding players with a higher multiplier for playing at a higher difficulty level. The number I place under the difficulty setting before multiplying it to the time remaining at the end of the course is where the question of fairness arises. If the ratio is too high then I&#8217;m unfairly rewarding the more skilled players while cheating those with lower difficulty settings&#8230;the inverse of this is true as well. I think that this may be something that I&#8217;ll wait to solidify when I release the app to the first batch of beta testers.<\/p>\n<p>Another decision I need to make is whether or not to include any form of social integration. Recently there had arrived two popular solutions for incorporating leader-boards and chat functionality into your application, <a href=\"http:\/\/www.openfeint.com\/\" target=\"_blank\">OpenFeint<\/a> and <a href=\"http:\/\/developer.agon-online.com\/\" target=\"_blank\">Agon<\/a>.   Both work in a sort of a plug and play manner&#8230;meaning I wouldn&#8217;t have to rewrite any of my code if I later opted to use them. But they seems to be more of an afterthought than anything else&#8230;just an  add-on. Does a cheese rolling game really need to be connected to the world? Would anyone actually utilize the leader-boards, or is this just another manifestation of the overhyped social media craze that our inter-webs seem to be plagued with nowadays.  If I do decide to use utilize of these components, it will probably be the absolute last thing that I incorporate.<\/p>\n","excerpt":"I'm giving this topic it's own posting because it's one of the most important elements to any game. I needed to create some type of rewards system\r\n","date":"2009-08-19 04:11:00","modified":"2012-03-28 17:00:31","categories":[{"id":3,"slug":"iphone-development","title":"iPhone development","description":"","parent":0,"post_count":14}],"tags":[{"id":5,"slug":"coopers-hill","title":"Coopers Hill","description":"","post_count":14},{"id":9,"slug":"ios","title":"iOS","description":"","post_count":11},{"id":10,"slug":"iphone","title":"iPhone","description":"","post_count":11},{"id":11,"slug":"unity","title":"Unity","description":"","post_count":11}],"author":{"id":1,"slug":"jeremyclewell","name":"jeremyclewell","first_name":"","last_name":"","nickname":"jeremyclewell","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"open"}]}